jamesweidev/tennis-robot/projects/03_mobile_ball_finder/firmware/STM32_ObjectAvoider/Core/BallFinder/Inc/main.h

#ifndef MAIN_H_
#define MAIN_H_

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include "stm32f4xx_hal.h"

#define PWM_PERIOD                  2500

#define US_GPIO_PORT			    GPIOA
#define US_TRIG_PIN				    GPIO_PIN_8
#define US_ECHO_PIN 			    GPIO_PIN_9


// New motor driver pins
#define RIGHT_MOTOR_DRIVER_PORT     GPIOA
#define AIN1_PIN				    GPIO_PIN_0
#define AIN1_CHANNEL                TIM_CHANNEL_1
#define AIN2_PIN				    GPIO_PIN_1
#define AIN2_CHANNEL                TIM_CHANNEL_2

#define LEFT_MOTOR_DRIVER_PORT      GPIOB
#define BIN1_PIN				    GPIO_PIN_10
#define BIN1_CHANNEL                TIM_CHANNEL_3
#define BIN2_PIN				    GPIO_PIN_2
#define BIN2_CHANNEL                TIM_CHANNEL_4


// Encoder IC is on TIM4
#define RIGHT_ENCA_PORT             GPIOB
#define RIGHT_ENCA_PIN              GPIO_PIN_6

#define RIGHT_ENCB_PORT             GPIOB
#define RIGHT_ENCB_PIN              GPIO_PIN_7

#define LEFT_ENCA_PORT              GPIOB
#define LEFT_ENCA_PIN               GPIO_PIN_4

#define LEFT_ENCB_PORT              GPIOB
#define LEFT_ENCB_PIN               GPIO_PIN_5

// Drive constants
#define PRE_GEAR_TICKS              48
#define GEAR_RATIO                  46.85f

#define WHEEL_DIAM_M                0.08f
#define WHEEL_CIRCUMFERENCE         (WHEEL_DIAM_M * M_PI)
#define TICKS_PER_ROTATION          (PRE_GEAR_TICKS * GEAR_RATIO)
#define TICKS_PER_METER             (TICKS_PER_ROTATION / WHEEL_CIRCUMFERENCE)

#define WHEEL_DISTANCE_M            0.154f // Basically the diameter of the robot's rotation

// Command UART6
#define UART6_GPIO_PORT             GPIOC
#define UART6_TX_PIN                GPIO_PIN_6
#define UART6_RX_PIN                GPIO_PIN_7

// Debug UART3
#define USART3_TX_PORT              GPIOC
#define USART3_TX_PIN               GPIO_PIN_10

// Directions
typedef enum
{
    ACTION_FORWARD,
    ACTION_REVERSE,
    ACTION_LEFT,
    ACTION_RIGHT,
    ACTION_STOP
} ActionType;

typedef struct {
    float prev_err;
    float i_value;
} PID_State;

typedef struct {
	volatile uint16_t prev_ticks;
	volatile float current_rpm;
    volatile int32_t target_rpm;
    int32_t final_target_rpm; // used to for smoother motor speed setting
    int32_t ticks_elapsed; // Tick delta since the beginning of a movement
    float starting_rpm; // RPM at the beginning of a movement
    int32_t sync_correction;
    PID_State pid;
    uint32_t active_pwm_channel;
    uint32_t inactive_pwm_channel;

    uint32_t prev_millis;
    float s_elapsed;

    TIM_HandleTypeDef* htimx;
} Encoder;

typedef enum {
    STATE_IDLE,
    TURNING_TO_BALL,
    DRIVING_TO_BALL,
    OBSTACLE_DETECTED
} RobotState;

// Robot movement
void Smooth_Drive(ActionType new_action);
void Draw_Circle(float radius);
void Stop_Robot();
uint16_t Get_Ticks(Encoder* enc);

float Get_PID_Correction(Encoder* enc);

uint32_t Get_Turn_Ticks(float degs);

// Command Receive
void Receive_Command(void);
void Command_UART6_Init(void);
void Command_Receive_Callback(void);

// State
void Update_State(void);

// ultrasonic
float Get_Distance(void);
uint32_t micros(void);
void delay_us(uint32_t micros);

// Inits
void Ultrasonic_GPIO_Init(void);
void TIM6_Micros_Init(void);
void TIM2_PWM_Init(void);
void Encoder_TIM3_TIM4_Init(void);
void SystemClock_Config(void);
void PID_TIM7_Init(void);

// debugging
void Debug_UART2_Init(void);
void Error_Handler(void);
void Update_LED(void);

#endif